#Область ОбработчикиКомандФормы

&НаКлиенте
Procedure СформироватьМеста(Command)
	
	Очиститьсообщения();
	СформироватьНаСервере();	
	
EndProcedure

&НаКлиенте
Процедура ЗаполнитьКомпоновку(Команда)
	
	ЗаполнитьКомпоновкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()

	Счетчик = НачалоРяда;	
	ПоследнееМестоВРяду = КонецРяда;
	
	Пока Счетчик <= ПоследнееМестоВРяду Цикл
		
		СпрОбъект = Справочники.чартер_ПосадочныеМестаНаРейс.СоздатьЭлемент();     
		СпрОбъект.Наименование = Строка(Счетчик) + НаименованиеРяда;
		СпрОбъект.Класс = Класс;
		СпрОбъект.КомпоновкаВС = КомпоновкаВС;
		
		Счетчик = Счетчик + 1; 
		СпрОбъект.Записать();		
		
	КонецЦикла;   
		
	чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Готово");	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомпоновкуНаСервере()
	
	Запрос = Новый запрос;
	Запрос.Текст =
					"ВЫБРАТЬ
					|	чартер_ПосадочныеМестаНаРейс.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.чартер_ПосадочныеМестаНаРейс КАК чартер_ПосадочныеМестаНаРейс
					|ГДЕ
					|	НЕ чартер_ПосадочныеМестаНаРейс.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СпрОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();  
		Если СпрОбъект.IsFolder Тогда
			Продолжить;
		Иначе	
			СпрОбъект.КомпоновкаВС = Перечисления.чартер_ТипВСРассадка.Boeing763_290PAX;
			СпрОбъект.Записать(); 
		КонецЕсли;
	КонецЦикла; 
	
	чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Готово");
	
КонецПроцедуры

#КонецОбласти
