
//&НаСервере
//Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
//	
//	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Рейс");
//	Параметр.Значение = Параметры.Рейс;            
//	Параметр.Использование = Истина; 
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
//	
//    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Рейс", Параметры.Рейс);   
//	
//КонецПроцедуры
