#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АэропортВылетаРейсаПриИзменении(Элемент)
	
	СформироватьПредставлениеМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура АэропортПрибытияРейсаПриИзменении(Элемент)
	
	СформироватьПредставлениеМаршрута();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьПредставлениеМаршрута()
	
	Объект.ПредставлениеМаршрута = "";
	Объект.ПредставлениеМаршрута = "";
	
	Объект.ПредставлениеМаршрута = Объект.АэропортВылетаРейса	+ " - " + Объект.АэропортПрибытияРейса;
	Объект.Наименование = Объект.ПредставлениеМаршрута;
		
КонецПроцедуры

#КонецОбласти