#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CurrentHotel = SessionParameters.CurrentHotel;
	CurrentDateField = Формат(CurrentSessionDate(), "DF='dd.MM.yyyy HH:mm'");

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаБорт(Команда)
	
	ОткрытьФорму("Документ.чартер_ЗаписьНаРейс.ФормаСписка");
				
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменитьБорт(Команда)
	
	ОткрытьФорму("Справочник.чартер_Рейсы.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносыСотруднников(Команда)
	
	ОткрытьФорму("Документ.чартер_ПереносБорта.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиСотрудников(Команда)
	
	ОткрытьФорму("Документ.чартер_ЗаписьНаРейс.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура АрхивБортов(Команда)
	
	ПарамертыВыбора = Новый Структура("Архив", Истина);		
	ОткрытьФорму("Справочник.чартер_Рейсы.ФормаСписка", ПарамертыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполненностьБорта(Команда)
	
	ОткрытьФорму("Справочник.чартер_Рейсы.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОтветственныхЛиц(Команда)
	
    ОткрытьФорму("Справочник.чартер_НастройкаРассылок.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники(Команда)
	
    ОткрытьФорму("Справочник.чартер_Сотрудники.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти