#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
 
// Получить квоты за период.
// 
// Параметры:
//  Параметры - Структура
// 
// Возвращаемое значение:
//  Неопределено, ВыборкаИзРезультатаЗапроса - Получить квоты за период
Функция ПолучитьКвотыЗаПериод(Параметры) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	чартер_КвотированиеОрганизацийНаРейсСрезПоследних.Организация КАК Организация,
					|	чартер_КвотированиеОрганизацийНаРейсСрезПоследних.Квота КАК КвотаНаРейс
					|ИЗ
					|	РегистрСведений.чартер_КвотированиеОрганизацийНаРейс.СрезПоследних(&ДатаРейса, ТипКомпановки = &ТипКомпановки) КАК
					|		чартер_КвотированиеОрганизацийНаРейсСрезПоследних";   
				
	Запрос.УстановитьПараметр("ДатаРейса", НачалоМесяца(Параметры.ДатаРейса));
	Запрос.УстановитьПараметр("ТипКомпановки", Параметры.ТипВС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Результат = РезультатЗапроса;		 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли