

&НаКлиенте
Процедура НадписьСчетаНаОплатуНажатие(Элемент)
	ОткрытьФорму("Документ.ProformaInvoice.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НадписьКонтрагентыНажатие(Элемент)
	ОткрытьФорму("Справочник.Контрагенты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НадписьНомернойФондНажатие(Элемент)
	ОткрытьФорму("Справочник.Rooms.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НадписьСозданиеНомеровНажатие(Элемент)
	ОткрытьФорму("Обработка.ЗагрузкаДанныхБезЗаселения4Комната.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗаявкаНаОбслуживаниеНажатие(Элемент)
	ОткрытьФорму("Документ.ЗаявкаНаОбслуживание.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НадписьПросроченныеЗаявкиНажатие(Элемент)
	ОткрытьФорму("Отчет.ПросроченныеЗаявки.Форма.ReportForm");
КонецПроцедуры

&НаКлиенте
Процедура НадписьВидыРаботНажатие(Элемент)
	ОткрытьФорму("Справочник.ВидыРаботПоОбслуживаниюЖилогоФонда.ФормаСписка");
КонецПроцедуры
