Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ПараметрПлощадка = Новый ПараметрКомпоновкиДанных("qHotel");
	ЗначениеПлощадки = Справочники.Hotels.НайтиПоКоду("001");
    КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПлощадка, ЗначениеПлощадки);
	
	СтатусРазмещения = Новый ПараметрКомпоновкиДанных("AccommodationStatus");
	ЗначениеСтатуса = Справочники.AccommodationStatuses.НайтиПоКоду("10");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(СтатусРазмещения, ЗначениеСтатуса);
	
	
КонецПроцедуры
	
