#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	НастройкиКомпановки = КомпоновщикНастроек.ПолучитьНастройки();	
	
	ПараметрыДаных = НастройкиКомпановки.ПараметрыДанных;
	
	СтатусДокументов = Справочники.AccommodationStatuses.НайтиПоКоду("10");  
	ПараметрыДаных.УстановитьЗначениеПараметра("AccommodationStatus", СтатусДокументов);
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпановки);

	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпановки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	УстановитьПривилегированныйРежим(Истина);
	// Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпановки, Истина);	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли	