
Процедура ЗаписатьДанные(Данные) Экспорт
	
	Попытка
		ЗаписьИстории = РегистрыСведений.ИсторияОбменовСВнешнимиСистемами.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьИстории, Данные);
		ЗаписьИстории.ИдентификаторЗапроса = ?(ЗначениеЗаполнено(ЗаписьИстории.ИдентификаторЗапроса), ЗаписьИстории.ИдентификаторЗапроса, Новый УникальныйИдентификатор);
		ЗаписьИстории.Период = ?(ЗначениеЗаполнено(ЗаписьИстории.Период), ЗаписьИстории.Период, ТекущаяДата());
		ЗаписьИстории.Записать();
	Исключение		
	КонецПопытки;
	
КонецПроцедуры