
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	                    
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗаполнитьТелоЗапроса(ТекущаяСтрока);	 
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТелоЗапроса(КлючЗаписи)
	
	Запись = РегистрыСведений.ИсторияОбменовСВнешнимиСистемами.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();

	Если Запись.Выбран() Тогда
		
		Если Запись.ФорматЗапроса = "JSON" Тогда		
			ТелоЗапроса = Запись.ТелоЗапроса.Получить();
			ТелоОтвета = Запись.ТелоОтвета.Получить();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры