
&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Rooms.Ссылка КАК Room,
	|	Rooms.Наименование КАК Наименование,
	|	Rooms.НомерКвартиры КАК НомерКвартиры
	|ИЗ
	|	Справочник.Rooms КАК Rooms
	|ГДЕ
	|	Rooms.Родитель = &Дом";
	
	Запрос.УстановитьПараметр("Дом", Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеНомера = Выборка.Наименование;
		НомерКвартиры = Выборка.НомерКвартиры;
		
		ВхождениеПервойСкобки = СтрНайти(НаименованиеНомера,"(");
		
		Если ВхождениеПервойСкобки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерДома = Лев(НаименованиеНомера, ВхождениеПервойСкобки -1); 
		
		ВхождениеКомнаты = СтрНайти(НаименованиеНомера,"комн.");
		
		Если ВхождениеКомнаты = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерКомнаты = Прав(НаименованиеНомера, СтрДлина(НаименованиеНомера) - (ВхождениеКомнаты + 4));
		
		НовоеНаименованиеНомера = НомерДома + "-" + НомерКвартиры + "/"+НомерКомнаты; 
		
		Если НовоеНаименованиеНомера<> НаименованиеНомера Тогда
			ДокументОбъект = Документы.ChangeRoom.СоздатьДокумент();
			ДокументОбъект.Room = Выборка.Room;
			
			ДокументОбъект.pmFillAttributesWithDefaultValues();
			
			ДокументОбъект.RoomNumber = НовоеНаименованиеНомера;
			
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Выполнено");	
КонецПроцедуры
