
&AtClient
Procedure СнятьУдаление(Command)
	СнятьУдалениеAtServer();
EndProcedure

&AtServer
Procedure СнятьУдалениеAtServer()
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Об =Сотрудник.ПолучитьОбъект();
	Об.ПометкаУдаления = Ложь;
	Об.Записать();

EndProcedure

&AtClient
Procedure ПометитьНаУдаление(Command)
	ПометитьНаУдалениеAtServer();
EndProcedure

&AtServer
Procedure ПометитьНаУдалениеAtServer()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Clients.Ссылка КАК Ref
		|ИЗ
		|	Справочник.Clients КАК Clients
		|ГДЕ
		|	Clients.ЗагруженИзЗУП = Ложь";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сообщить(ВыборкаДетальныеЗаписи.Количество());
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об = ВыборкаДетальныеЗаписи.ref.GetObject();
		Об.ПометкаУдаления = Истина;
		об.Записать();
	КонецЦикла;
	
EndProcedure
