Функция ПолучитьСтруктуруДанныхФайла(ФайлСсылка) Экспорт
	
	ФайлСтруктура = Новый Структура;
	ФайлСтруктура.Вставить("Наименование", ФайлСсылка.Наименование);
	ФайлСтруктура.Вставить("ПолноеИмяФайла", ФайлСсылка.ПолноеИмяФайла);
	ФайлСтруктура.Вставить("ИмяФайла", ФайлСсылка.ИмяФайла);
	ФайлСтруктура.Вставить("РасширениеФайла", ФайлСсылка.РасширениеФайла);
	ФайлСтруктура.Вставить("Адрес", ПолучитьАдресВременногоХранилищаФайла(ФайлСсылка));
	ФайлСтруктура.Вставить("РазмерФайла", ФайлСсылка.РазмерФайла);
	
	Возврат ФайлСтруктура;
	
КонецФункции

Функция ПолучитьАдресВременногоХранилищаФайла(ФайлСсылка)
	
	Возврат ПоместитьВоВременноеХранилище(ФайлСсылка.Файл.Получить(), Новый УникальныйИдентификатор);
	
КонецФункции
