#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписьВЛог(СтруктураЗаписиЛога) Экспорт
	
	ЗаписьРС = СоздатьМенеджерЗаписи();
	ЗаписьРС.Период = СтруктураЗаписиЛога.Период;	
	ЗаписьРС.ТипСобытия = СтруктураЗаписиЛога.ТипСобытия;
	ЗаписьРС.ФункциональныйБлок = СтруктураЗаписиЛога.ФункциональныйБлок;
	ЗаписьРС.ОписаниеСобытия = СтруктураЗаписиЛога.ОписаниеСобытия;
	ЗаписьРС.Пользователь = SessionParameters.CurrentUser;
	
	Попытка
		ЗаписьРС.Записать();		
	Исключение    
		ОписаниеОшибки = ОписаниеОшибки();
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда           			
			чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(ОписаниеОшибки);	
		КонецЕсли;
	КонецПопытки;  
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
