#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран рейс для построения отчета!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;    
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Рейс", ПараметрКоманды);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

	Уникальность = ПараметрКоманды.УникальныйИдентификатор();	
	ОткрытьФорму("Отчет.чартер_ОтчетПоЗаполненностиБорта.ФормаОбъекта", ПараметрыФормы,, Уникальность);	

КонецПроцедуры

#КонецОбласти