#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
 
// Возвращает текущий статус сотрудика в организации
// 
// Параметры:
//  Сотрудник - СправочникСсылка.чартер_Сотрудники 
//  Результат - Неопределено - Результат
// 
// Возвращаемое значение:
// 	ПеречислениеСсылка.чартер_СтатусСотрудникаВОрганизации  
//  
Функция ПолучитьСтатусСотрудникаВОрганизации(Сотрудник, Результат = Неопределено) Экспорт
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	чартер_Сотрудники.СтатусСотрудникаВОрганизации КАК СтатусСотрудникаВОрганизации
	               |ИЗ
	               |	Справочник.чартер_Сотрудники КАК чартер_Сотрудники
	               |ГДЕ
	               |	чартер_Сотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СтатусСотрудникаВОрганизации;
	
КонецФункции

#КонецОбласти

#КонецЕсли