#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
    Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;	
	КонецЕсли;  
	
	ЭтоСотрудник = Справочники.чартер_Сотрудники.ПолучитьСтатусСотрудникаВОрганизации(Сотрудник);
	
	Если ЭтоНовый() И ЭтоСотрудник = Перечисления.чартер_СтатусСотрудникаВОрганизации.Сотрудник Тогда					                                            
		Если чартеры_ОбщиеПроцедурыИФункцииСервер.ПроверитьДубльРегистрацииНаРейс(Рейс, ТабельныйНомер) Тогда 			
			
			ИнфоСообщение = СтрШаблон("Сотрудник с табельным номером %1 уже зарегистрирован на рейс %2!"
										, ТабельныйНомер, Рейс);
			чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(ИнфоСообщение);		
			Отказ = Истина;
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры           

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.чартер_ЗаписьНаРейс.Записывать = Истина;
		
	Запись = Движения.чартер_ЗаписьНаРейс.Добавить();
	
	Запись.Период				= ТекущаяДатаСеанса();
	Запись.Регистратор 			= Ссылка;
	Запись.Организация 			= Ссылка.Организация;		
	Запись.Сотрудник  			= Ссылка.Сотрудник;
	Запись.ТабельныйНомер 		= Ссылка.ТабельныйНомер;
	Запись.Должность 			= Ссылка.Должность;
	Запись.ФИО 					= Ссылка.ФИО;
	Запись.ФИОАнглийское		= Ссылка.ФИОАнглийское;
	Запись.Рейс 				= Ссылка.Рейс; 
	Запись.Место				= Ссылка.Место;
	Запись.Подразделение 		= Ссылка.Подразделение;		
	Запись.СтатусНаРейсе 	    = Ссылка.СтатусНаРейсе;
	Запись.ПричиныВылета 		= Ссылка.ПричиныВылета;
	Запись.SLIP 				= Ссылка.SLIP;
	Запись.НомерТелефона 		= Ссылка.НомерТелефона;
	Запись.Комментарий 	        = Ссылка.Комментарий;
	Запись.ВКакойНОТеЗаявлены   = Ссылка.ВКакойНОТеЗаявлены;
	Запись.ДополнительныйБагаж	= Ссылка.ДополнительныйБагаж;
	Запись.Исполнитель 		    = SessionParameters.CurrentUser;
	Запись.ДатаИзменения 	    = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Организация = Справочники.чартер_Организации.ПустаяСсылка(); 
	Сотрудник = Справочники.чартер_Сотрудники.ПустаяСсылка();	
	Место = Справочники.чартер_ПосадочныеМестаНаРейс.ПустаяСсылка();
	ДатаИзменения = Дата('00010101');	
	ВКакойНОТеЗаявлены = "";
	НомерТелефона = "";
	SLIP = "";
	Комментарий = ""; 
	Исполнитель = ""; 
	Подразделение = "";  
	ПричиныВылета = "";  
	ТабельныйНомер = "";
	ФИО = "";
	Должность = "";
	
КонецПроцедуры

#КонецОбласти                                

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли