#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ТабличныйДокумент", ТабличныйДокумент) Тогда
        Отказ = истина;
	Конецесли;
	
	Параметры.Свойство("Заголовок", ЭтаФорма.Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Excel 2007 (*.xlsx)|*.xlsx|PDF (*.pdf)|*.pdf'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСохранениеВФайл", ЭтотОбъект);
	//ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбораФайла);		
	чартер_ОбщиеПроцедурыИфункцииКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбораФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьСохранениеВФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	ПозицияТочка = СтрНайти(ПолноеИмяФайла, ".", НаправлениеПоиска.СКонца);
	РасширениеФайла = ВРЕГ(Прав(СокрЛП(ПолноеИмяФайла),СтрДлина(ПолноеИмяФайла)-ПозицияТочка));
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента[РасширениеФайла]);
	
КонецПроцедуры

#КонецОбласти